{
  "backend/main.mo": "Main backend actor implementing a gaming tournament platform with user registration, match management, payment processing, and admin controls using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of conditional admin navigation in the frontend with high confidence, listing affected files and components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for user registration, match management, payment processing, admin pages, and the new AccessDeniedScreen component for access control.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with gaming aesthetic including neon accent colors.",
  "frontend/index.html": "HTML entry point for the ACE8WIN application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for user and admin pages, registration modal logic, and theme provider wrapper.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable component displaying an access denied message with shield icon and navigation button for users lacking admin privileges.",
  "frontend/src/components/DuplicateJoinWarning.tsx": "Alert dialog warning users when attempting to join a match they've already registered for with proceed or cancel options.",
  "frontend/src/components/Layout.tsx": "Main layout component with responsive header navigation, conditional admin links based on role, authentication controls, hero background, and footer with caffeine.ai attribution.",
  "frontend/src/components/MatchCard.tsx": "Displays a match card with details like name, start time, participants, and entry fee. Handles join/rejoin logic with duplicate warning and navigates to payment page.",
  "frontend/src/components/RegistrationModal.tsx": "Modal for user registration that collects game UID, game name, phone number, and refund QR code image. Validates phone number format and uploads QR code with progress tracking.",
  "frontend/src/components/UpiQrCode.tsx": "Generates and displays a UPI payment QR code using an external API service based on provided UPI ID and payment amount.",
  "frontend/src/components/UserDeleteConfirmation.tsx": "Alert dialog component for confirming permanent deletion of a user account with loading state during deletion.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile, match management, payment submission, transaction history, and admin functions like payment approval and user deletion.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark gaming theme using OKLCH color space, defining neon cyan/purple/green accent colors and gaming-specific card styles with backdrop blur effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminMatchCreate.tsx": "Admin-only page for creating new matches with form inputs for match name, start date/time, duration, and payment amount; validates admin access and submits match data to backend.",
  "frontend/src/pages/AdminMatchParticipants.tsx": "Admin-only page displaying a table of participants for a specific match with their game UID, name, and phone number, including WhatsApp contact buttons for each participant.",
  "frontend/src/pages/AdminPayments.tsx": "Admin-only dashboard listing all active matches with participant counts and navigation buttons to view detailed participant information for payment management.",
  "frontend/src/pages/AdminUserManagement.tsx": "Admin-only page for managing all registered users with search functionality, displaying user profiles in a table with WhatsApp contact and delete user capabilities.",
  "frontend/src/pages/PaymentPage.tsx": "User-facing payment submission page that displays UPI QR code for a specific match, allows uploading payment proof screenshot with progress tracking, and shows confirmation after successful submission.",
  "frontend/src/pages/TransactionHistory.tsx": "Displays user's transaction history with status badges (approved/rejected/pending), showing match details, amounts, timestamps, and refund status for each transaction.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard page that displays available 1vs1 matches filtered by status (live/upcoming), requires authentication via Internet Identity, and shows loading states and empty states with gaming-themed UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom gaming theme colors (neon-cyan, neon-purple, neon-green), OKLCH color system, custom shadows, animations, and responsive container settings.",
  "project_state.json": "Project state document defining ACE8WIN as a gaming matchmaking platform with UPI payment integration, admin match creation, user registration with game details, payment proof workflow, and transaction/refund tracking features."
}